{
  "jobs": [
    {
      "employer": "Amazon - Kindle Instant Previews",
      "position": "Web Development Engineer",
      "startYear": "2014",
      "endYear": null,
      "description": "Worked on the world's most versatile e-book previewer. Designed and implementation the app's modular, multi-layered SASS framework, and led the development of its ultra-lightweight embeddable widget."
    },
    {
      "employer": "Infinitarium",
      "position": "Lead Developer",
      "startYear": "2011",
      "endYear": "2014",
      "description": "As lead developer, I worked on numerous websites, web apps and mobile games, handling such diverse tasks as UX design, visual design, front-end development, tooling, Node.JS servers, deployment strategies and infrastructure."
    },
    {
      "employer": "INIA - Agricultural Research Institute",
      "position": "Web Developer",
      "startYear": "2012",
      "endYear": "2013",
      "description": "Designed and developed a large-scale Wordpress portal, as well as various custom plugins tailored to the client’s particular needs."
    },
    {
      "employer": "Blink",
      "position": "Personal project",
      "startYear": "2011",
      "endYear": "2011",
      "description": "Created an HTML5 game programming library. Blink’s component-oriented API and extensive feature set gave my team a critical advantage in time-constrained game jams."
    },
    {
      "employer": "DentalChile",
      "position": "Personal project",
      "startYear": "2009",
      "endYear": "2010",
      "description": "Helped architect and develop a web-based CRM. The app crunches large volumes of medical data into helpful charts that assist the CEO in the decision-making process."
    },
    {
      "employer": "Technical University Federico Santa Maria",
      "position": "Teacher",
      "startYear": "2008",
      "endYear": "2009",
      "description": "Taught a game programming course on Java for mobile devices (J2ME), and co-founded a local chapter of the USM Games organization."
    },
    {
      "employer": "Freelance work",
      "position": "Self-employed",
      "startYear": "2008",
      "endYear": "2010",
      "description": "Designed and coded personal portfolios, educational websites, online catalogs, etc. I worked with individuals and companies alike, both local and foreign."
    },
    {
      "employer": "Scania Maipu",
      "position": "IT intern",
      "startYear": "2004",
      "endYear": "2004",
      "description": "Interned at an automotive parts retailer. This was my first glimpse of the pivotal role of computer software in running a business."
    }
  ]
}