{
  "jobs": [
    {
      "employer": "AWS Control Tower",
      "position": "Sr. Design Technologist",
      "startYear": "2018",
      "endYear": "2019",
      "description": "Created a UX prototype for a new AWS service, gathering early stakeholder feedback, uncovering technical constraints, defining data models, and delivering UX-approved JSX code."
    },
    {
      "employer": "AWS Service Catalog",
      "position": "Web Development Engineer",
      "startYear": "2017",
      "endYear": "2018",
      "description": "Built frontend components in Material Design. Designed and prototyped \"Brand your console\", a feature that lets IT administrators customize Service Catalog's theme colors."
    },
    {
      "employer": "Amazon Kindle Instant Previews",
      "position": "Web Development Engineer",
      "startYear": "2014",
      "endYear": "2017",
      "description": "Worked on the world's most versatile e-book previewer. Highlights include a modular SASS framework, and a lightweight widget you can embed anywhere."
    },
    {
      "employer": "Infinitarium",
      "position": "Lead Developer",
      "startYear": "2011",
      "endYear": "2014",
      "description": "Worked on websites, web apps and mobile games, doing UI design, visual design, front-end development, tooling, Node.JS servers, devops, and agile methodologies."
    },
    {
      "employer": "INIA - Agricultural Research Institute",
      "position": "Web Developer",
      "startYear": "2012",
      "endYear": "2013",
      "description": "Designed and developed a large-scale Wordpress portal, as well as various custom plugins tailored to the client’s particular needs."
    },
    {
      "employer": "Blink",
      "position": "Personal project",
      "startYear": "2011",
      "endYear": "2011",
      "description": "Created an HTML5 game programming library. Blink’s component-oriented API and extensive feature set gave my team a critical advantage in time-constrained game jams."
    },
    {
      "employer": "DentalChile",
      "position": "Freelance developer",
      "startYear": "2009",
      "endYear": "2010",
      "description": "Helped architect and develop a web-based CRM. The app crunches large volumes of medical data into helpful charts that assist DentalChile's CEO in decision-making."
    },
    {
      "employer": "Technical University Federico Santa Maria",
      "position": "Teacher",
      "startYear": "2008",
      "endYear": "2009",
      "description": "Taught a Java mobile game programming course and co-founded a local chapter of the USM Games organization."
    },
    {
      "employer": "Various",
      "position": "Freelance developer",
      "startYear": "2008",
      "endYear": "2010",
      "description": "Designed and coded personal portfolios, educational websites, online catalogs, etc. I worked with individuals and companies alike, both local and foreign."
    }
  ]
}